{ 
  "MENU": {
    "ABOUT_ME": "About Me",
    "PROJECTS": "Projects",
    "EDUCATION": "Education",
    "LANGUAGES": "Languages",
    "SKILLS": "Other skills"
  },
  "CONTACT_DATA": {
    "BIRTHPLACE": "Residance",
    "BIRTHDATE": "Birthdate",
    "CHANGE_LANG": "Change language"
  },
  "ABOUT_ME": {
    "PRESENTATION" : "Hi, I’m Joel — a Frontend Developer and Interactive Designer with a strong background in <strong>React + Next.js, Angular, and Vue.js</strong>, building projects across diverse industries since 2019. I’m passionate about working on challenging projects that push me to keep learning and refining my skills. I enjoy exploring and implementing new technologies, best practices, libraries, and frameworks to create scalable, efficient, and user-friendly solutions. Beyond technical development, I value collaboration and knowledge-sharing, always striving to add clarity and consistency to the projects I work on. </br>Since 2023, I’ve also taken on the responsibility of coordinating a development team, which has deepened my interest in leadership, project management, and team dynamics. This experience has allowed me to grow not only as a developer but also as someone who can guide, support, and motivate others. I consider myself a curious and adaptable professional who enjoys continuous growth, whether by embracing new tools, experimenting with fresh ideas, or contributing to projects in different fields."
  },
  "EDUCATION": {
    "COMPLETED": "Completed",
    "NOT_COMPLETED": "Not Completed",
    "COURSE_1": "High School Degree at CEF San Buenaventura",
    "COURSE_2": "Technical Degree in Interactive Design at La Metro",
    "COURSE_3": "Bachelor of Social Communication at UNC",
    "COURSE_4": "Fullstack Web Developer at Acámica",
    "COURSE_5": "Product Owner at Kinetic"
  },
  "SKILLS": {
    "SPANISH": "Spanish (Native)",
    "ENGLISH": "English Advanced (B2)"
  },
  "PROJECTS": {
    "SKILLS": "Tech stack for this position",
    "PROJECT_6": {
      "TITLE": "Globant",
      "AREA": "Airlines",
      "PERIOD": "Nov 2024 - Now",
      "DESC": "I worked on a team responsible for managing all ancillary services for a major British airline, specifically developing features related to seat selection and baggage within the reservation system. Our stack included <strong>React, Next.js, and TypeScript</strong>, with unit testing implemented using <strong>Vitest</strong>. A key focus of the project was ensuring compliance with European airline <strong>accessibility (A11Y)</strong> regulations."
    },
    "PROJECT_1": {
      "TITLE": "JS Software",
      "AREA": "Retailing",
      "PERIOD": "Jun 2023 - Nov 2024",
      "DESC": "I was responsible for the company’s main project, a Back Office web application developed with <strong>React and Next.js</strong>, where I carried out both management and development tasks. When I joined, I introduced and implemented agile methodologies, as they had not been applied before. Additionally, for the same company, I worked on another project—an e-commerce platform for retailers built with <strong>Vue.js</strong>. Although the project had already been started, it required a full refactor to make it adaptable for clients across different industries."
    },
    "PROJECT_2": {
      "TITLE": "Mendel",
      "AREA": "Fintech",
      "PERIOD": "Feb 2022 - Jun 2023",
      "DESC": "I worked on the company’s main project, a web application for the management and control of corporate expenses, developed with <strong>Angular</strong>. My main duties and responsibilities inclued: Developing new user-facing web features, creating reusable code and libraries for future use, ensuring the technical feasibility of UI/UX designs, optimizing applications for maximum speed and scalability.</li></ul> I was one of the people responsible for the frontend area and occasionally conducted technical interviews."
    },
    "PROJECT_3": {
      "TITLE": "Bitlogic",
      "AREA": "Education",
      "PERIOD": "Jun 2019 - Feb 2022",
      "DESC": "I worked on two of the company’s main projects: <br/>1) Web application for university students in <strong>React</strong>: In this project, I applied technologies such as unit testing with Jest, Enzyme, and React Testing Library, as well as <strong>Redux, Material UI, Bootstrap, and Node.js</strong> (Axios and Express.js) <br/> 2) Web application for commercial staff in <strong>Angular</strong>: This project was designed to sell university career packages. Alongside frontend development, I also performed backend tasks using Java (SpringBoot) and Node.js. <br/>For both projects, I worked with agile methodologies <strong>(Scrum), JIRA, AWS, CI/CD, and GitLab</strong>, and I gained experience in pipeline configuration."
    },
    "PROJECT_4": {
      "TITLE": "Trompo Agencia",
      "AREA": "Digital Marketing",
      "PERIOD": "Jan 2018 - Jun 2019",
      "DESC": "In charge of the Web Development area, focused on Frontend tasks. I worked with Wordpress and Prestashop templates, in most cases customizing templates for different clients. I also developed sites in HTML5, CSS3 and JavaScript, either from scratch or customizing templates. I used frameworks like Bootstrap and JQuery."
    },
    "PROJECT_5": {
      "TITLE": "Criterio Net",
      "AREA": "Digital Marketing",
      "PERIOD": "Sep 2011 - Jun 2013 ",
      "DESC": "This experience started as a Collage Intership and ended up becoming a full-time job. I was in charge of the Web Development area, focused on frontend and support tasks. I worked with Wordpress and Prestashop templates, in most cases customizing templates for different clients. I also developed sites in HTML5, CSS3 and JavaScript, either from scratch or customizing templates. I used frameworks like Bootstrap and JQuery."
    }
  }
}